import pickle

celebrity_list = {0: '10cm 권정열', 1: 'BTS RM', 2: 'BTS 뷔', 3: 'BTS 슈가', 4: 'BTS 정국', 5: 'BTS 제이홉', 6: 'BTS 지민', 7: 'BTS 진', 
8: 'EXO 디오', 9: 'EXO 레이', 10: 'EXO 백현', 11: 'EXO 세훈', 12: 'EXO 수호', 13: 'EXO 시우민', 14: 'EXO 찬열', 15: 'EXO 카이', 
16: '김종국', 17: '로꼬', 18: '박재범', 19: '박효신', 20: '블락비 지코', 21: '블락비 피오', 22: '비와이', 23: '빅뱅 지드래곤', 
24: '성시경', 25: '세븐틴 도겸', 26: '세븐틴 디노', 27: '세븐틴 디에잇', 28: '세븐틴 민규', 29: '세븐틴 버논', 30: '세븐틴 승관', 
31: '세븐틴 에스쿱스', 32: '세븐틴 우지', 33: '세븐틴 원우', 34: '세븐틴 정한', 35: '세븐틴 조슈아', 36: '세븐틴 준', 37: '세븐틴 호시',
 38: '송민호', 39: '슈퍼주니어 규현', 40: '슈퍼주니어 동해', 41: '슈퍼주니어 려욱', 42: '슈퍼주니어 시원', 43: '슈퍼주니어 신동', 44: '슈퍼주니어 예성', 
 45: '슈퍼주니어 은혁', 46: '슈퍼주니어 이특', 47: '슈퍼주니어 희철', 48: '쌈디', 49: '영탁', 50: '이무진', 51: '이승기', 52: '이찬원', 53: '임영웅', 
 54: '존박', 55: '카더가든', 56: '케이윌', 57: '테이', 58: '폴킴', 59: 'EXID 솔지', 60: 'EXID 하니', 61: '걸스데이 혜리', 62: '다비치 강민경', 
 63: '다비치 이해리', 64: '레드벨벳 슬기', 65: '레드벨벳 아이린', 66: '레드벨벳 예리', 67: '레드벨벳 웬디', 68: '레드벨벳 조이', 69: '마마무 문별', 70: '마마무 솔라',
 71: '미스에이 수지', 72: '블랙핑크 로제', 73: '블랙핑크 리사', 74: '블랙핑크 제니', 75: '블랙핑크 지수', 76: '선미', 
 77: '소녀시대 수영', 78: '소녀시대 써니', 79: '소녀시대 유리', 80: '소녀시대 윤아', 81: '소녀시대 태연', 82: '소녀시대 티파니',
  83: '씨스타 다솜', 84: '씨스타 보라', 85: '씨스타 소유', 86: '씨스타 효린', 87: '아이브 가을', 88: '아이브 레이', 
  89: '아이브 리즈', 90: '아이브 원영', 91: '아이브 유진', 92: '아이유', 93: '에스파 닝닝', 94: '에스파 윈터', 
  95: '에스파 지젤', 96: '에스파 카리나', 97: '에일리', 98: '여자아이들 미연', 99: '여자아이들 민니', 
  100: '여자아이들 소연', 101: '여자아이들 슈화', 102: '여자아이들 우기', 103: '오마이걸 미미', 104: '오마이걸 승희', 
  105: '오마이걸 아린', 106: '오마이걸 유아', 107: '오마이걸 효정', 108: '윤하',109: '이달의 소녀 츄', 110: '이효리', 
  111: '정은지', 112: '청하', 113: '트와이스 나연', 114: '트와이스 다현', 115: '트와이스 모모', 116: '트와이스 미나', 
  117: '트와이스 사나', 118: '트와이스 정연', 119: '트와이스 지효', 120: '트와이스 쯔위', 121: '트와이스 채영', 
  122: '프로미스나인 백지헌', 123: '헤이즈', 124: '현아'}

# with open('pt\\celebrity_list.pkl','wb') as f:
#     pickle.dump(celebrity_list,f)

# f = open('pt\\celebrity_list.pkl','rb')
# celebrity_list = pickle.load(f)
# f.close()

# print(celebrity_list[1].split()[0] == 'BTS')

# dic = {}

# for v in range(3):
#     dic[v] = {v:v}

# print(dic)

# for v in celebrity_list.values():
#     print(v, end=", ")

def testing():
  return '10'
